music_app/app/controllers/bands_controller.rb

  def create
    @new_band = Band.new(name: params[:band][:name])
    if @new_band.save!
---
INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Rock N Roll"], ["created_at", "2019-09-05 21:19:48.372379"], ["updated_at", "2019-09-05 21:19:48.372379"]]