music_app/app/controllers/users_controller.rb

  def create
    @user = User.new(strong_params)
    if @user.save
---
INSERT INTO "users" ("password_digest", "session_token", "email") VALUES ($1, $2, $3) RETURNING "id"  [["password_digest", "$2a$12$YuyJ03yxVwd1tuu/BsLZyOosvDoc6BaFmh4xQR7C8cLE2RZWrmIpK"], ["session_token", "KeVSotm0pGmVYlUe3Nusxw"], ["email", "awddadw"]]